#!/usr/bin/python


import matplotlib.pyplot as plt
import numpy as np


import seaborn as sns
import pandas as pd


'''
#- Ідентифікувати та описати проблеми у цій візуалізації даних (я очікую від вас текст)

Діаграмма загромождена даними через що важко сприймается. Візуально неможливо оцінити, наскільки змінюється показник по регіонам щодо двох років тому, що всі дані відображені в одному стовпці діаграми, внаслідок чого обидва перекриваються.


#- Зробити альтернативний варіант презентації цих даних (я очікую від вас візуалізацію та пояснення, чому вона працює ліпше, ніж оригінальна)

Набір даних може бути представлений у більш наглядній формі, якщо розділити графік на 5 різних діаграм за областями діяльності. Оскільки діаграма будується за текстовими полями з названими областями, то це зручно відкласти назви областей по осі ординату, а числові дані по осі абцисс.
Вцілому зручність представлення залежить від контексту застосування графічної інформації. Зазвичай графіки представляють в доповіддях. Обговорення даних залежить від кола зібраних спеціалістів. Якщо, наприклад, голови областних міст, щоб зручніше побудувати графіки по областях, щоб указати на недопрацювання конкретними посадовим особами, а якщо глави відомств, то це дані необхідно групувати за сферою діяльності.

#Регіон, рік; сільське господарство; промисловість; будівництво; послуги; державне управління
'''



Regions=[ 'Україна', 'Вінницька', 'Волинська', 'Дніпропетровська', 'Донецька', 'Житомирська', 'Закарпатська',  'Івано-Франківська', 'Київська', 'Кіровоградська', 'Луганська', 'Львівська', 'Миколаївська', 'Одеська', 'Полтавська', 'Рівненська', 'Сумська', 'Тернопільська', 'Харківська', 'Херсонська', 'Хмельницька', 'Черкаська', 'Чернівецька', 'Чернігівська', 'м.Київ']

X=['сільське господарство', 'промисловість', 'будівництво', 'послуги', 'державне управління']



Data=pd.read_csv('data.csv',sep=';')
Data.head(1)

print(Data)

yy=Data.groupby('region')
print(yy.count())

#Data.plot()"agriculture";"industrial";"building";"services";"goverment"

ax=sns.barplot(y='region',x='agriculture',hue='years',data=Data)
ax.set(xlabel='ВДВ.',ylabel='Регіон')
ax.legend(loc=1)
plt.title('Структура ВДВ по сільскому господарству.')
plt.show()

ax=sns.barplot(y='region',x='industrial',hue='years',data=Data)
ax.set(xlabel='ВДВ.',ylabel='Регіон')
ax.legend(loc=1)
plt.title('Структура ВДВ по промислвості.')
plt.show()

sns.barplot(y='region',x='building',hue='years',data=Data)
ax.set(xlabel='ВДВ.',ylabel='Регіон')
ax.legend(loc=1)
plt.title('Структура ВДВ по будівництву.')
plt.show()

sns.barplot(y='region',x='services',hue='years',data=Data)
ax.set(xlabel='ВДВ.',ylabel='Регіон')
ax.legend(loc=1)
plt.title('Структура ВДВ по сфері послуг.')
plt.show()

sns.barplot(y='region',x='goverment',hue='years',data=Data)
ax.set(xlabel='ВДВ.',ylabel='Регіон')
ax.legend(loc=1)
plt.title('Структура ВДВ по державному управлінню.')
plt.show()

